Repository: Nima786/aio-woocommerce
Catalog: aio-woocommerce/languages/aio-woocommerce-*.po
Languages: fa_ir

source: Persian Calendar
fa_ir: تقویم شمسی

source: Cart, Min & Max Rules
fa_ir: قوانین سبد خرید، حداقل و حداکثر

source: Payment Gateways
fa_ir: درگاه‌های پرداخت

source: Misc & Cleanup
fa_ir: متفرقه و پاکسازی

source: Persian Calendar Settings
fa_ir: تنظیمات تقویم شمسی

source: Configure Persian calendar conversion across WordPress admin screens, frontend tools, and optional WooCommerce areas.
fa_ir: پیکربندی تبدیل تقویم شمسی در صفحات مدیریت وردپرس، ابزارهای فرانت‌اند و بخش‌های اختیاری ووکامرس.

source: WordPress Admin Dates
fa_ir: تاریخ‌های مدیریت وردپرس

source: Control conversion across core WordPress areas such as Posts, Pages, Media Library, and any custom post types.
fa_ir: کنترل تبدیل در بخش‌های اصلی وردپرس مانند نوشته‌ها، برگه‌ها، کتابخانه رسانه و انواع نوشته‌های سفارشی.

source: Convert List/Table Dates
fa_ir: تبدیل تاریخ‌های لیست/جدول

source: Switch all WordPress admin date columns (Posts, Pages, Media, custom types) to the Persian calendar while respecting the saved time zone.
fa_ir: تبدیل تمام ستون‌های تاریخ در مدیریت وردپرس (نوشته‌ها، برگه‌ها، رسانه، انواع سفارشی) به تقویم شمسی با حفظ منطقه زمانی ذخیره شده.

source: Convert WordPress Date Pickers
fa_ir: تبدیل انتخابگرهای تاریخ وردپرس

source: Use Persian date pickers on default WordPress filters (Posts, Media, Taxonomies) and in the Gutenberg editor calendar popovers.
fa_ir: استفاده از انتخابگرهای تاریخ شمسی در فیلترهای پیش‌فرض وردپرس (نوشته‌ها، رسانه، دسته‌بندی‌ها) و در پنجره‌های تقویم ویرایشگر گوتنبرگ.

source: Save WordPress Settings
fa_ir: ذخیره تنظیمات وردپرس

source: WooCommerce Admin Dates
fa_ir: تاریخ‌های مدیریت ووکامرس

source: These options handle WooCommerce-specific screens such as Orders, Products, and WooCommerce reports. They are optional when WooCommerce is not installed.
fa_ir: این گزینه‌ها صفحات خاص ووکامرس مانند سفارش‌ها، محصولات و گزارش‌های ووکامرس را مدیریت می‌کنند. در صورت نصب نبودن ووکامرس اختیاری هستند.

source: Convert WooCommerce Dates
fa_ir: تبدیل تاریخ‌های ووکامرس

source: Display WooCommerce-specific dates (Orders, Products, coupons, reports) in the Persian calendar.
fa_ir: نمایش تاریخ‌های خاص ووکامرس (سفارش‌ها، محصولات، کوپن‌ها، گزارش‌ها) در تقویم شمسی.

source: Convert WooCommerce Date Pickers
fa_ir: تبدیل انتخابگرهای تاریخ ووکامرس

source: Use Persian date pickers on WooCommerce filters (Orders, Reports, Analytics) without affecting WordPress core pages.
fa_ir: استفاده از انتخابگرهای تاریخ شمسی در فیلترهای ووکامرس (سفارش‌ها، گزارش‌ها، تحلیل‌ها) بدون تأثیر بر صفحات اصلی وردپرس.

source: Save WooCommerce Settings
fa_ir: ذخیره تنظیمات ووکامرس

source: Shortcodes
fa_ir: شورت‌کدها

source: Format Tips
fa_ir: نکات فرمت

source: Plugin Settings
fa_ir: تنظیمات افزونه

source: Global preferences for how the AIO WooCommerce plugin behaves.
fa_ir: ترجیحات کلی برای نحوه عملکرد افزونه AIO WooCommerce.

source: Data Cleanup
fa_ir: پاکسازی داده

source: Choose whether to delete plugin data automatically when you delete the plugin.
fa_ir: انتخاب اینکه آیا داده‌های افزونه به صورت خودکار هنگام حذف افزونه پاک شوند یا خیر.

source: Remove data when deleting plugin
fa_ir: حذف داده هنگام حذف افزونه

source: When enabled, all plugin settings (including payment gateway credentials) are erased from the database during plugin deletion.
fa_ir: هنگام فعال بودن، تمام تنظیمات افزونه (شامل اطلاعات درگاه پرداخت) در هنگام حذف افزونه از پایگاه داده پاک می‌شوند.

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Admin Typography
fa_ir: تایپوگرافی مدیریت

source: Access Control
fa_ir: کنترل دسترسی

source: Choose which WordPress roles can manage this plugin. Administrators always retain access.
fa_ir: انتخاب کنید کدام نقش‌های وردپرس می‌توانند این افزونه را مدیریت کنند. مدیران همیشه دسترسی خواهند داشت.

source: Settings already up to date.
fa_ir: تنظیمات از قبل به‌روز است.

source: Administrator
fa_ir: مدیر

source: Editor
fa_ir: ویرایشگر

source: Author
fa_ir: نویسنده

source: Contributor
fa_ir: همکار

source: Subscriber
fa_ir: مشترک

source: Shop manager
fa_ir: مدیر فروشگاه

source: Change the font that appears inside the AIO WooCommerce admin experience.
fa_ir: تغییر فونتی که در محیط مدیریت AIO WooCommerce نمایش داده می‌شود.

source: Select a font
fa_ir: انتخاب فونت

source: Choose one of the bundled presets or switch to "Upload custom font" to use your own files.
fa_ir: یکی از پیش‌تنظیمات موجود را انتخاب کنید یا به "آپلود فونت سفارشی" تغییر دهید تا از فایل‌های خود استفاده کنید.

source: Upload custom font
fa_ir: آپلود فونت سفارشی

source: Custom font family name
fa_ir: نام خانواده فونت سفارشی

source: This text is used inside CSS. It should match the font's "font-family" name.
fa_ir: این متن در CSS استفاده می‌شود. باید با نام "font-family" فونت مطابقت داشته باشد.

source: Upload font file
fa_ir: آپلود فایل فونت

source: Upload / Choose
fa_ir: آپلود / انتخاب

source: Supported formats: WOFF2, WOFF, TTF, OTF. One regular weight is enough—other styles can be added via custom CSS if needed.
fa_ir: فرمت‌های پشتیبانی شده: WOFF2، WOFF، TTF، OTF. یک وزن معمولی کافی است—سبک‌های دیگر در صورت نیاز می‌توانند از طریق CSS سفارشی اضافه شوند.

source: WooCommerce is not active. WooCommerce-specific features are optional and the Persian calendar tools will still run for WordPress.
fa_ir: ووکامرس فعال نیست. ویژگی‌های خاص ووکامرس اختیاری هستند و ابزارهای تقویم شمسی همچنان برای وردپرس کار می‌کنند.

source: Install or activate WooCommerce to enable this option.
fa_ir: ووکامرس را نصب یا فعال کنید تا این گزینه فعال شود.

source: Requires WooCommerce.
fa_ir: نیاز به ووکامرس دارد.

source: WordPress default
fa_ir: پیش‌فرض وردپرس

source: Vazirmatn (Google Fonts)
fa_ir: وزیرمتن (گوگل فونت‌ها)

source: Estedad (Google Fonts)
fa_ir: استعداد (گوگل فونت‌ها)

source: Save All Settings
fa_ir: ذخیره تمام تنظیمات

source: Security check failed.
fa_ir: بررسی امنیتی ناموفق بود.

source: Permission denied.
fa_ir: دسترسی رد شد.

source: Settings saved successfully.
fa_ir: تنظیمات با موفقیت ذخیره شد.

source: Error saving settings.
fa_ir: خطا در ذخیره تنظیمات.

source: Configure cart minimum totals and quantity limits based on product pricing or taxonomy.
fa_ir: پیکربندی حداقل مجموع سبد خرید و محدودیت‌های تعداد بر اساس قیمت یا دسته‌بندی محصول.

source: Minimum Cart Total
fa_ir: حداقل مجموع سبد خرید

source: Minimum Quantity Rules
fa_ir: قوانین حداقل تعداد

source: Maximum Quantity Rules
fa_ir: قوانین حداکثر تعداد

source: Enforce minimum cart total
fa_ir: اجرای حداقل مجموع سبد خرید

source: When enabled, the cart must meet the minimum total before checkout.
fa_ir: هنگام فعال بودن، سبد خرید باید قبل از تسویه حساب به حداقل مجموع برسد.

source: Minimum Cart Total (Toman)
fa_ir: حداقل مجموع سبد خرید (تومان)

source: Customers must reach this cart total before they can checkout.
fa_ir: مشتریان باید قبل از تسویه حساب به این مجموع سبد خرید برسند.

source: Cart Minimum Message
fa_ir: پیام حداقل سبد خرید

source: Available placeholders: {min_total}, {current_total}.
fa_ir: متغیرهای موجود: {min_total}، {current_total}.

source: Save Cart Minimum Settings
fa_ir: ذخیره تنظیمات حداقل سبد خرید

source: Rules are evaluated from top to bottom. Leave the maximum price empty to cover all higher prices.
fa_ir: قوانین از بالا به پایین ارزیابی می‌شوند. برای پوشش تمام قیمت‌های بالاتر، حداکثر قیمت را خالی بگذارید.

source: Enforce minimum quantity rules
fa_ir: اجرای قوانین حداقل تعداد

source: Toggle off to ignore all minimum quantity tiers regardless of price.
fa_ir: برای نادیده گرفتن تمام سطوح حداقل تعداد بدون توجه به قیمت، خاموش کنید.

source: Minimum Price (Toman)
fa_ir: حداقل قیمت (تومان)

source: Maximum Price (Toman)
fa_ir: حداکثر قیمت (تومان)

source: Minimum Quantity
fa_ir: حداقل تعداد

source: Add Rule
fa_ir: افزودن قانون

source: Quantity Adjustment Message
fa_ir: پیام تنظیم تعداد

source: Available placeholders: {product}, {min_qty}, {price}.
fa_ir: متغیرهای موجود: {product}، {min_qty}، {price}.

source: Exclude Categories
fa_ir: حذف دسته‌بندی‌ها

source: No categories found.
fa_ir: دسته‌بندی‌ای یافت نشد.

source: Selected categories will bypass minimum quantity rules.
fa_ir: دسته‌بندی‌های انتخاب شده از قوانین حداقل تعداد عبور می‌کنند.

source: Exclude Tags
fa_ir: حذف برچسب‌ها

source: No tags found.
fa_ir: برچسبی یافت نشد.

source: Selected tags will bypass minimum quantity rules.
fa_ir: برچسب‌های انتخاب شده از قوانین حداقل تعداد عبور می‌کنند.

source: Save Quantity Rules
fa_ir: ذخیره قوانین تعداد

source: Set optional caps for how many units a customer can buy, targeting specific products, categories, tags, or the entire store.
fa_ir: تعیین محدودیت‌های اختیاری برای تعداد واحدهایی که مشتری می‌تواند بخرد، با هدف قرار دادن محصولات، دسته‌بندی‌ها، برچسب‌ها یا کل فروشگاه.

source: Limit entire store
fa_ir: محدود کردن کل فروشگاه

source: Maximum quantity
fa_ir: حداکثر تعداد

source: Limit specific categories
fa_ir: محدود کردن دسته‌بندی‌های خاص

source: Choose categories
fa_ir: انتخاب دسته‌بندی‌ها

source: Limit specific tags
fa_ir: محدود کردن برچسب‌های خاص

source: Choose tags
fa_ir: انتخاب برچسب‌ها

source: Limit specific products
fa_ir: محدود کردن محصولات خاص

source: Product IDs (comma separated)
fa_ir: شناسه‌های محصول (جدا شده با کاما)

source: Enter product IDs separated by commas. Leave empty to disable product-specific rule.
fa_ir: شناسه‌های محصول را جدا شده با کاما وارد کنید. برای غیرفعال کردن قانون خاص محصول، خالی بگذارید.

source: Save Maximum Rules
fa_ir: ذخیره قوانین حداکثر

source: Configure Persian payment gateway integrations for WooCommerce. All settings are managed here.
fa_ir: پیکربندی یکپارچه‌سازی درگاه‌های پرداخت فارسی برای ووکامرس. تمام تنظیمات در اینجا مدیریت می‌شوند.

source: Zarinpal
fa_ir: زرین‌پال

source: Zibal
fa_ir: زیبال

source: Enter your Zarinpal Merchant ID (Merchant Code) obtained from your Zarinpal account.
fa_ir: مرچنت کد زرین‌پال (کد پذیرنده) خود را که از حساب زرین‌پال خود دریافت کرده‌اید وارد کنید.

source: Optional access token for refund service.
fa_ir: توکن دسترسی اختیاری برای سرویس استرداد وجه.

source: Use sandbox mode for testing. Disable for live payments.
fa_ir: برای تست از حالت آزمایشی استفاده کنید. برای پرداخت‌های واقعی غیرفعال کنید.

source: Normal Gateway
fa_ir: درگاه عادی

source: ZarinGate
fa_ir: زرین‌گیت

source: ZarinLink
fa_ir: زرین‌لینک

source: Choose the gateway type. ZarinGate requires special activation from Zarinpal.
fa_ir: نوع درگاه را انتخاب کنید. زرین‌گیت نیاز به فعال‌سازی خاص از زرین‌پال دارد.

source: Message shown after successful payment. Use {transaction_id} for tracking code.
fa_ir: پیام نمایش داده شده پس از پرداخت موفق. از {transaction_id} برای کد رهگیری استفاده کنید.

source: Message shown after failed payment. Use {fault} for error reason.
fa_ir: پیام نمایش داده شده پس از پرداخت ناموفق. از {fault} برای دلیل خطا استفاده کنید.

source: Copy this code to your site footer to display Zarinpal trust logo.
fa_ir: این کد را در فوتر سایت خود کپی کنید تا لوگوی اعتماد زرین‌پال نمایش داده شود.

source: Save Zarinpal Settings
fa_ir: ذخیره تنظیمات زرین‌پال

source: Save Zibal Settings
fa_ir: ذخیره تنظیمات زیبال

source: Note:
fa_ir: یادداشت:

source: Payment gateway settings are managed here in the plugin. The "Enable" button in WooCommerce → Settings → Payments will sync back to these settings automatically. However, we recommend managing all settings here for consistency.
fa_ir: تنظیمات درگاه پرداخت در این افزونه مدیریت می‌شوند. دکمه "فعال‌سازی" در ووکامرس → تنظیمات → پرداخت‌ها به صورت خودکار با این تنظیمات همگام می‌شود. با این حال، برای سازگاری توصیه می‌کنیم تمام تنظیمات را در اینجا مدیریت کنید.

source: Available Shortcodes:
fa_ir: شورت‌کدهای موجود:

source: Current Date:
fa_ir: تاریخ فعلی:

source: Display current date (default format based on settings)
fa_ir: نمایش تاریخ فعلی (فرمت پیش‌فرض بر اساس تنظیمات)

source: Display current date in Persian format only
fa_ir: نمایش تاریخ فعلی فقط به فرمت شمسی

source: Display current date in Gregorian format only
fa_ir: نمایش تاریخ فعلی فقط به فرمت میلادی

source: Display date with month name (e.g. 02 November 2025)
fa_ir: نمایش تاریخ با نام ماه (مثال: ۰۲ آبان ۱۴۰۴)

source: Display both Persian and Gregorian dates
fa_ir: نمایش هر دو تاریخ شمسی و میلادی

source: Post Date:
fa_ir: تاریخ نوشته:

source: Display post published date (default format based on settings)
fa_ir: نمایش تاریخ انتشار نوشته (فرمت پیش‌فرض بر اساس تنظیمات)

source: Display post date in Persian format only
fa_ir: نمایش تاریخ نوشته فقط به فرمت شمسی

source: Display post date in Gregorian format only
fa_ir: نمایش تاریخ نوشته فقط به فرمت میلادی

source: Display date for specific post
fa_ir: نمایش تاریخ برای نوشته خاص

source: Display post modified date instead of published date
fa_ir: نمایش تاریخ ویرایش نوشته به جای تاریخ انتشار

source: Display with weekday (e.g. دوشنبه ۲ آبان ۱۴۰۴)
fa_ir: نمایش با نام روز هفته (مثال: دوشنبه ۲ آبان ۱۴۰۴)

source: Order Date:
fa_ir: تاریخ سفارش:

source: Display order date in Persian format
fa_ir: نمایش تاریخ سفارش به فرمت شمسی

source: Display with readable month name and time
fa_ir: نمایش با نام ماه خوانا و زمان

source: Page Builder Compatibility:
fa_ir: سازگاری با صفحه‌سازها:

source: These shortcodes work with:
fa_ir: این شورت‌کدها با موارد زیر کار می‌کنند:

source: Bricks Builder - Use shortcode element or dynamic tags
fa_ir: Bricks Builder - استفاده از المان شورت‌کد یا تگ‌های داینامیک

source: Gutenberg - Use Shortcode block
fa_ir: Gutenberg - استفاده از بلاک شورت‌کد

source: Elementor - Use Shortcode widget
fa_ir: Elementor - استفاده از ویجت شورت‌کد

source: Other page builders - Use Shortcode element/widget
fa_ir: سایر صفحه‌سازها - استفاده از المان/ویجت شورت‌کد

source: Zarinpal Payment Gateway
fa_ir: درگاه پرداخت زرین‌پال

source: Zarinpal payment gateway settings for WooCommerce
fa_ir: تنظیمات درگاه پرداخت زرین‌پال برای ووکامرس

source: Basic Settings
fa_ir: تنظیمات پایه‌ای

source: Enable Zarinpal Gateway
fa_ir: فعال‌سازی درگاه زرین‌پال

source: Gateway Title
fa_ir: عنوان درگاه

source: Secure Payment via Zarinpal
fa_ir: پرداخت امن زرین‌پال

source: Gateway Description
fa_ir: توضیحات درگاه

source: Secure payment via all Shetab member cards through Zarinpal gateway
fa_ir: پرداخت امن به وسیله کلیه کارت‌های عضو شتاب از طریق درگاه زرین‌پال

source: Zarinpal Account Settings
fa_ir: تنظیمات حساب زرین‌پال

source: Merchant ID
fa_ir: مرچنت کد

source: Access Token (Optional - for refund service)
fa_ir: توکن دسترسی (اختیاری - ویژه سرویس استرداد وجه)

source: Enable Sandbox Mode
fa_ir: فعال‌سازی حالت آزمایشی

source: Payment Operation Settings
fa_ir: تنظیمات عملیات پرداخت

source: Gateway Type
fa_ir: نوع درگاه

source: Deduct Commission From
fa_ir: کسر کارمزد از

source: Merchant (Default)
fa_ir: پذیرنده (پیش‌فرض)

source: Customer
fa_ir: مشتری

source: Success Payment Message
fa_ir: پیام پرداخت موفق

source: Failed Payment Message
fa_ir: پیام پرداخت ناموفق

source: Post Purchase Description
fa_ir: توضیحات پس از خرید

source: Zarinpal Trust Logo Code
fa_ir: کد تراست لوگوی زرین‌پال

source: Zibal Payment Gateway
fa_ir: درگاه پرداخت زیبال

source: Zibal payment gateway settings for WooCommerce
fa_ir: تنظیمات درگاه پرداخت زیبال برای ووکامرس

source: Enable Zibal Gateway
fa_ir: فعال‌سازی درگاه زیبال

source: Check this box to enable Zibal payment gateway.
fa_ir: برای فعال‌سازی درگاه پرداخت زیبال باید چک باکس را تیک بزنید.

source: The gateway title displayed to customers during checkout.
fa_ir: عنوان درگاه که در طی خرید به مشتری نمایش داده می‌شود.

source: Description shown during the payment process for the gateway.
fa_ir: توضیحاتی که در طی عملیات پرداخت برای درگاه نمایش داده خواهد شد.

source: Zibal Account Settings
fa_ir: تنظیمات حساب زیبال

source: Enter your Zibal gateway Merchant ID.
fa_ir: مرچنت کد درگاه زیبال.

source: Enable Zibal Sandbox Mode
fa_ir: فعال‌سازی حالت آزمایشی زیبال

source: Check this box to enable Zibal sandbox mode for testing.
fa_ir: برای فعال‌سازی حالت آزمایشی زیبال چک باکس را تیک بزنید.

source: Enter the message you want to display to users after successful payment. You can also use the {transaction_id} shortcode to display the tracking code (Zibal transaction code).
fa_ir: متن پیامی که می‌خواهید بعد از پرداخت موفق به کاربر نمایش دهید را وارد نمایید. همچنین می‌توانید از شورت کد {transaction_id} برای نمایش کد رهگیری (کد تراکنش زیبال) استفاده نمایید.

source: Thank you. Your order has been successfully paid.
fa_ir: با تشکر از شما. سفارش شما با موفقیت پرداخت شد.

source: Enter the message you want to display to users after failed payment. You can also use the {fault} shortcode to display the error reason. This error reason is sent from the Zibal website.
fa_ir: متن پیامی که می‌خواهید بعد از پرداخت ناموفق به کاربر نمایش دهید را وارد نمایید. همچنین می‌توانید از شورت کد {fault} برای نمایش دلیل خطای رخ داده استفاده نمایید. این دلیل خطا از سایت زیبال ارسال می‌گردد.

source: Your payment was unsuccessful. Please try again or contact the site administrator if there is an issue.
fa_ir: پرداخت شما ناموفق بوده است. لطفاً مجدداً تلاش نمایید یا در صورت بروز اشکال با مدیر سایت تماس بگیرید.

source: Secure payment via all Shetab member cards through Zibal gateway
fa_ir: پرداخت امن به وسیله کلیه کارت‌های عضو شتاب از طریق درگاه زیبال
